10/data/attachments/8f706242fe3e1d48.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a0190080-e586-4dc7-b364-b59b2cc15082</nif:username>
            <nif:friendToBeAdded>Ashley_money_Friend_25694_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>